package com.kh;

public class 스택_힙 {
    /*
    Stack과 Heap 이란?
        컴퓨터가 프로그램을 실행할 때 사용하는 두 가지 주요 메모리 공간

    Stack (스택)
        임시 작업 공간
        짧은 시간 동안 사용하는 데이터를 잠시 저장하는 공간

        특징
        - 임시 저장소 : 함수 호출 중 만들어지는 변수(지역 변수)와 같은 데이터를 저장
        -
        -

    Heap (힙)
        긴 시간 동안 사용하는 데이터 저장소
        프로그램 실행 중 필요 할 때 메모리를 따로 요청해서 사용하는 공간

        특징
        - 유연한 사용 : 배열, 객체 등 프로그램이 끝날 때 까지 사용해야하는 데이터를 저장
        - 크기가 큼 : 메모리 공간이 Stack 보다 넓음
        - 수동 관리 : 데이터를 사용하지 않으면 직접 삭제나 참조
     */
}
