package com.kh.oop.basic;

/*
    客體 (= 객체  손객 몸체   손 = 손님 = 특정지을 수 없는 대상)
    객관식( = 주체적이지 않은 상태의 객 , 볼 관 , 특정 형식이나 방법의 방식)
    객체(Object) 클래스(class)를 기반으로 생성된 실체
    컴퓨터 내에서 표현하고자 하는 형태를 나타내는데 사용
    속성(멤버 변수)과 행동(메서드 = 기능) 구성
    * */
public class 객체 {
    // 필드 = 속성 = 멤버 변수 = 전역 변수
    //인스턴트 변수 : 접근제한자와 자료형 사이에 static이 없는 변수
    // 변수 HEAP 메모리에 할당
    // 클래스 변수 : 접근제한자 static 자료형 사이에 static이 있는 변수
    // STATIC 메모리에 할당 : 항상 어디서든 사용 할 수 있도록 준비된 것, 굴로벌 변수

    // 필드

    // 메서드
        // 기본 생성자
        // 필수 생성자
        // Setter
        // Getter

}